# NonMonotoneRoof Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..NonMonotoneRoof Property
BuiltInFailures..::..SketchFailures Class See Also
---
All parts of an extruded roof must face upward. Make sure that no part of the sketch lies below any other part of the sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NonMonotoneRoof { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NonMonotoneRoof As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NonMonotoneRoof {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace